In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',  
'londON_StockhOlm', 
'Budapest_PaRis', 'Brussels_londOn'], 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
'12. Air France', '"Swiss Air"']})

1. Some values in the the FlightNumber column are missing. These numbers are  meant to increase by 10 with each row so 10055 and 10075 need to be put in  place. Fill in these missing numbers and make the column an integer column  (instead of a float column).

In [ ]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df.head()

2. The From_To column would be better as two separate columns! Split each  string on the underscore delimiter _ to give a new temporary DataFrame with  the correct values. Assign the correct column names to this temporary  DataFrame.

In [ ]:
temp = pd.DataFrame(df.From_To)
temp[['From','To']] = temp.From_To.str.split('_',expand = True)
temp.drop('From_To',axis=1,inplace=True)
temp['From'] = temp['From'].str.title()
temp['To'] = temp['To'].str.title()
temp.head()

3. Notice how the capitalisation of the city names is all mixed up in this  temporary DataFrame. Standardise the strings so that only the first letter is  uppercase (e.g. "londON" should become "London".)

In [ ]:
df['From_To'] = df.From_To.str.capitalize()
df.head()

4. Delete the From_To column from df and attach the temporary DataFrame  from the previous questions.

In [ ]:
df = df.drop('From_To', 1)
df = pd.concat([df,temp], axis = 1)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

5. In the RecentDelays column, the values have been entered into the  DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value  should be NaN. 
Expand the Series of lists into a DataFrame named delays, rename the columns  delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df  with delays.

In [ ]:
a = pd.DataFrame(df['RecentDelays'].tolist(),columns=['delay_1','delay_2','delay_3'])
df = df.drop('RecentDelays', 1)
df.insert(2, "Delay_1", objs['delay_1'])
df.insert(3, "Delay_2", objs['delay_2'])
df.insert(4, "Delay_3", objs['delay_3'])
df

   FlightNumber              Airline  Delay_1  ...  Delay_3      From         To
0         10045               KLM(!)     23.0  ...      NaN    London      Paris
1         10055    <Air France> (12)      NaN  ...      NaN    Madrid      Milan
2         10065  (British Airways. )     24.0  ...     87.0    London  Stockholm
3         10075       12. Air France     13.0  ...      NaN  Budapest      Paris
4         10085          "Swiss Air"     67.0  ...      NaN  Brussels     London

[5 rows x 7 columns]